package com.tmmk.shdbd.math;

/**
 * 02 | 余数：原来取余操作本身就是个哈希函数
 *
 * @author Lost
 * @version 4.14.0
 * @date 2021-08-03 21:36
 */
public class lesson2 {

    /**
     * 第2节余数
     * 1.余数的特性
     * 整数是没有边界的,它可能是正无穷,也可能是负无穷。
     * 余数却总是在一个固定的范围内。生活中,余数可以用来算星期, web 编程中可以用在分页中。
     *
     * 2.同余定理
     * 两个整数 a 和 b ,如果它们除以正整数 m 得到的余数相等,我们就可以说, a 和 b 对于模 m 同余。
     * 同余定理其实就是用来分类的.
     *
     *  3求余过程就是个哈希函数
     *  每个编程语言都有对应的哈希函数。
     * 哈希有的时候也会被翻译为散列,简单来说就是将任意长度的输入,通过哈希算法压缩为某一固定长度的输出。
     */

    // 经典应用场景： 定位数据表的，分表设计
}
